package org.rebelland.rcore.model.boosts;

public enum StackingStrategy {
    SUM,            // 5 + 5 = 10 (Здоровье, слоты)
    CHANCE_CAP,     // 50% + 60% = 100% (Крит, шанс дропа)
    MULTIPLIER,     // x1.5 * x1.2 = x1.8 (Монеты)

    // НОВЫЕ:

    MIN_BEST,       // Берется МЕНЬШЕЕ число из всех бустов.
    // Пример: КД грядки. Один буст дает 5 сек, другой 2 сек.
    // Работает тот, у которого 2 сек. Они не складываются.

    MAX_BEST;       // Берется БОЛЬШЕЕ число, но они НЕ складываются.
    // Пример: Если бы "Радиус подбора" не стакался.
    // Один дает 3 блока, другой 5. Работает 5.
}
